In [1]:
import numpy as np
import pandas as pd

In [2]:
weather_data = {
    'day': ['1/1/2023','2/1/2023','3/1/2023','4/1/2023','5/1/2023'],
    'temperature': [32,35,28,24,32],
    'windspeed':[6,7,2,7,4],
    'event': ['sunny','cloudy','sunny','cloudy','cloudy']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed   event
0  1/1/2023           32          6   sunny
1  2/1/2023           35          7  cloudy
2  3/1/2023           28          2   sunny
3  4/1/2023           24          7  cloudy
4  5/1/2023           32          4  cloudy

In [3]:
df.shape

(5, 4)

In [4]:
df.head()

        day  temperature  windspeed   event
0  1/1/2023           32          6   sunny
1  2/1/2023           35          7  cloudy
2  3/1/2023           28          2   sunny
3  4/1/2023           24          7  cloudy
4  5/1/2023           32          4  cloudy

In [5]:
df.tail()

        day  temperature  windspeed   event
0  1/1/2023           32          6   sunny
1  2/1/2023           35          7  cloudy
2  3/1/2023           28          2   sunny
3  4/1/2023           24          7  cloudy
4  5/1/2023           32          4  cloudy

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          5 non-null      object
 1   temperature  5 non-null      int64
 2   windspeed    5 non-null      int64
 3   event        5 non-null      object
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [7]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [8]:
df['day']

0    1/1/2023
1    2/1/2023
2    3/1/2023
3    4/1/2023
4    5/1/2023
Name: day, dtype: object

In [9]:
df[['day','windspeed','event']]

        day  windspeed   event
0  1/1/2023          6   sunny
1  2/1/2023          7  cloudy
2  3/1/2023          2   sunny
3  4/1/2023          7  cloudy
4  5/1/2023          4  cloudy

In [10]:
df.iloc[2]

day            3/1/2023
temperature          28
windspeed             2
event             sunny
Name: 2, dtype: object

In [11]:
df.iloc[[0,3,4]]

        day  temperature  windspeed   event
0  1/1/2023           32          6   sunny
3  4/1/2023           24          7  cloudy
4  5/1/2023           32          4  cloudy

In [12]:
df.iloc[0:4,2]

0    6
1    7
2    2
3    7
Name: windspeed, dtype: int64

In [13]:
df.iloc[0:4,[0,2,3]]

        day  windspeed   event
0  1/1/2023          6   sunny
1  2/1/2023          7  cloudy
2  3/1/2023          2   sunny
3  4/1/2023          7  cloudy

In [14]:
df[1:3]

        day  temperature  windspeed   event
1  2/1/2023           35          7  cloudy
2  3/1/2023           28          2   sunny

In [15]:
df.set_index('event',inplace=True)
df

             day  temperature  windspeed
event
sunny   1/1/2023           32          6
cloudy  2/1/2023           35          7
sunny   3/1/2023           28          2
cloudy  4/1/2023           24          7
cloudy  5/1/2023           32          4

In [16]:
df.loc['sunny']

            day  temperature  windspeed
event
sunny  1/1/2023           32          6
sunny  3/1/2023           28          2

In [17]:
df.loc['cloudy']

             day  temperature  windspeed
event
cloudy  2/1/2023           35          7
cloudy  4/1/2023           24          7
cloudy  5/1/2023           32          4

In [18]:
df.reset_index(inplace=True)
df

    event       day  temperature  windspeed
0   sunny  1/1/2023           32          6
1  cloudy  2/1/2023           35          7
2   sunny  3/1/2023           28          2
3  cloudy  4/1/2023           24          7
4  cloudy  5/1/2023           32          4

In [19]:
df = pd.read_csv('weather_data.csv')
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [20]:
df = pd.read_excel('weather_data.xlsx',sheet_name='Sheet1')
df.head()

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow

In [24]:
import requests
url_link = 'https://pokemondb.net/pokedex/all'
r = requests.get(url_link,headers ={'User-Agent':'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, Like Gecko) Chrome/91.0.4472.124 Safari/537.36'})
read_html_pandas_data = pd.read_html(r.text)[0]
df= pd.DataFrame(read_html_pandas_data)
df

,#,Name,Type,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed
0,1,Bulbasaur,Grass Poison,318,45,49,49,65,65,45
1,2,Ivysaur,Grass Poison,405,60,62,63,80,80,60
2,3,Venusaur,Grass Poison,525,80,82,83,100,100,80
3,3,Venusaur Mega Venusaur,Grass Poison,625,80,100,123,122,120,80
4,4,Charmander,Fire,309,39,52,43,60,50,65
...,...,...,...,...,...,...,...,...,...,...
1185,1004,Chi-Yu,Dark Fire,570,55,80,80,135,120,100
1186,1005,Roaring Moon,Dragon Dark,590,105,139,71,55,101,119
1187,1006,Iron Valiant,Fairy Fighting,590,74,130,90,120,60,116
1188,1007,Koraidon,Fighting Dragon,670,100,135,115,85,100,135
1189,1008,Miraidon,Electric Dragon,670,100,85,100,135,115,135

In [25]:
df.shape

(1190, 10)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1190 entries, 0 to 1189
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   #        1190 non-null   int64
 1   Name     1190 non-null   object
 2   Type     1190 non-null   object
 3   Total    1190 non-null   int64
 4   HP       1190 non-null   int64
 5   Attack   1190 non-null   int64
 6   Defense  1190 non-null   int64
 7   Sp. Atk  1190 non-null   int64
 8   Sp. Def  1190 non-null   int64
 9   Speed    1190 non-null   int64
dtypes: int64(8), object(2)
memory usage: 93.1+ KB

In [28]:
df.to_csv('pokadexallmaster.csv',index = False)

In [29]:
df.to_excel('pokadexallmaster.xlsx',sheet_name='ALL',index = False)

In [30]:
df['Type'].unique()

array(['Grass Poison', 'Fire', 'Fire Flying', 'Fire Dragon', 'Water',
       'Bug', 'Bug Flying', 'Bug Poison', 'Normal Flying', 'Normal',
       'Dark Normal', 'Poison', 'Electric', 'Electric Psychic', 'Ground',
       'Ice Steel', 'Poison Ground', 'Fairy', 'Ice', 'Ice Fairy',
       'Normal Fairy', 'Poison Flying', 'Bug Grass', 'Ground Steel',
       'Dark', 'Steel', 'Fighting', 'Fire Rock', 'Water Fighting',
       'Psychic', 'Water Poison', 'Rock Ground', 'Rock Electric',
       'Psychic Fairy', 'Water Psychic', 'Poison Psychic',
       'Electric Steel', 'Water Ice', 'Poison Dark', 'Ghost Poison',
       'Electric Grass', 'Grass Psychic', 'Grass Dragon', 'Fire Ghost',
       'Poison Fairy', 'Ground Rock', 'Grass', 'Ice Psychic',
       'Fighting Fire', 'Fighting Water', 'Water Flying', 'Water Dark',
       'Rock Water', 'Rock Flying', 'Ice Flying', 'Psychic Flying',
       'Electric Flying', 'Fighting Flying', 'Dark Flying', 'Dragon',
       'Dragon Flying', 'Psychic Fighting', 'Water Electric',
       'Fairy Flying', 'Electric Dragon', 'Water Fairy', 'Rock',
       'Grass Flying', 'Water Ground', 'Ghost', 'Normal Psychic',
       'Bug Steel', 'Ground Flying', 'Steel Ground', 'Dark Poison',
       'Bug Rock', 'Bug Fighting', 'Dark Ice', 'Fighting Poison',
       'Ice Ground', 'Water Rock', 'Steel Flying', 'Dark Fire',
       'Water Dragon', 'Rock Dark', 'Psychic Grass', 'Fire Fighting',
       'Water Grass', 'Grass Dark', 'Bug Water', 'Grass Fighting',
       'Bug Ground', 'Bug Ghost', 'Dark Ghost', 'Steel Fairy',
       'Steel Rock', 'Fighting Psychic', 'Fire Ground', 'Ground Dragon',
       'Dragon Fairy', 'Rock Psychic', 'Ground Psychic', 'Rock Grass',
       'Rock Bug', 'Ice Water', 'Steel Psychic', 'Dragon Psychic',
       'Ground Fire', 'Grass Ground', 'Water Steel', 'Normal Water',
       'Rock Steel', 'Ghost Flying', 'Normal Fighting', 'Ghost Dark',
       'Dragon Ground', 'Fighting Steel', 'Poison Bug', 'Poison Fighting',
       'Grass Ice', 'Ice Ghost', 'Electric Ghost', 'Electric Fire',
       'Electric Water', 'Electric Ice', 'Steel Dragon', 'Fire Steel',
       'Ghost Dragon', 'Psychic Fire', 'Grass Fairy', 'Ground Dark',
       'Fire Psychic', 'Ice Fire', 'Dark Fighting', 'Ground Ghost',
       'Normal Ghost', 'Normal Grass', 'Water Ghost', 'Bug Electric',
       'Grass Steel', 'Ghost Fire', 'Ground Electric', 'Dark Steel',
       'Dark Dragon', 'Bug Fire', 'Steel Fighting', 'Rock Fighting',
       'Flying', 'Dragon Fire', 'Dragon Electric', 'Dragon Ice',
       'Normal Ground', 'Fire Normal', 'Fighting Dark', 'Steel Ghost',
       'Dark Psychic', 'Poison Water', 'Poison Dragon', 'Electric Normal',
       'Rock Dragon', 'Rock Ice', 'Electric Fairy', 'Rock Fairy',
       'Ghost Grass', 'Ice Rock', 'Flying Dragon', 'Psychic Ghost',
       'Psychic Dark', 'Fire Water', 'Grass Ghost', 'Fire Dark',
       'Fighting Ice', 'Bug Fairy', 'Water Bug', 'Poison Fire',
       'Ghost Ground', 'Ghost Fairy', 'Normal Dragon', 'Dragon Fighting',
       'Psychic Steel', 'Rock Poison', 'Psychic Dragon', 'Fighting Ghost',
       'Flying Steel', 'Bug Psychic', 'Rock Fire', 'Flying Water',
       'Electric Poison', 'Fire Bug', 'Dark Fairy', 'Ice Bug',
       'Psychic Normal', 'Electric Dark', 'Dragon Ghost', 'Fairy Steel',
       'Dark Grass', 'Psychic Ice', 'Ground Normal', 'Bug Dark',
       'Electric Fighting', 'Grass Normal', 'Poison Normal',
       'Ground Grass', 'Grass Fire', 'Flying Dark', 'Steel Poison',
       'Dragon Normal', 'Flying Fighting', 'Dragon Water',
       'Ground Fighting', 'Fairy Psychic', 'Electric Ground',
       'Fighting Electric', 'Fire Poison', 'Dark Ground', 'Dragon Dark',
       'Fairy Fighting', 'Fighting Dragon'], dtype=object)

In [31]:
df['Type'].nunique()

218

In [32]:
df['Type'].value_counts()

Water              81
Normal             79
Psychic            47
Grass              46
Fire               37
                   ..
Fire Water          1
Fire Dark           1
Fighting Ice        1
Normal Dragon       1
Fighting Dragon     1
Name: Type, Length: 218, dtype: int64

In [33]:
with pd.ExcelWriter('differentTypepokadex.xlsx',engine ='xlsxwriter') as writer:
    df[df['Type'] == 'Water'].to_excel(writer,sheet_name='WATER',engine = 'xlsxwriter', index=False)
    df[df['Type'] == 'Normal'].to_excel(writer,sheet_name='NORMAL',engine = 'xlsxwriter', index=False)
    df[df['Type'] == 'Psychic'].to_excel(writer,sheet_name='PSYCHIC',engine = 'xlsxwriter', index=False)
    df[df['Type'] == 'Grass'].to_excel(writer,sheet_name='GRASS',engine = 'xlsxwriter', index=False)
    df[df['Type'] == 'Fire'].to_excel(writer,sheet_name='FIRE',engine = 'xlsxwriter', index=False)